gemma-4-31b-it/bf16/H_office-baseline.log
INFO 05-06 01:54:27 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 05-06 01:54:27 [nixl_utils.py:32] NIXL is available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfb6d2c67ab60>, trust_remote_code=False, seed=42, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4000, random_output_len=500, random_range_ratio='0.9', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='google/gemma-4-31B-it', input_len=None, output_len=None, tokenizer='google/gemma-4-31B-it', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=0.3, burstiness=0.7, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='H_office-baseline.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-e384cc5f-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='gemma-4-31b', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
INFO 05-06 01:54:30 [utils.py:90] Sampling input_len from [399, 7600] and output_len from [49, 950]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 0.3
Burstiness factor: 0.7 (Gamma distribution)
Maximum request concurrency: None
100%|██████████| 200/200 [25:13<00:00,  7.57s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           0.30      
Benchmark duration (s):                  1513.24   
Total input tokens:                      815399    
Total generated tokens:                  97092     
Request throughput (req/s):              0.13      
Output token throughput (tok/s):         64.16     
Peak output token throughput (tok/s):    195.00    
Peak concurrent requests:                168.00    
Total token throughput (tok/s):          603.00    
---------------Time to First Token----------------
Mean TTFT (ms):                          204312.77 
Median TTFT (ms):                        164378.83 
P50 TTFT (ms):                           164378.83 
P90 TTFT (ms):                           448397.36 
P95 TTFT (ms):                           467614.94 
P99 TTFT (ms):                           510630.23 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          1167.54   
Median TPOT (ms):                        1128.89   
P50 TPOT (ms):                           1128.89   
P90 TPOT (ms):                           1582.79   
P95 TPOT (ms):                           1975.45   
P99 TPOT (ms):                           2774.86   
---------------Inter-token Latency----------------
Mean ITL (ms):                           1064.65   
Median ITL (ms):                         562.99    
P50 ITL (ms):                            562.99    
P90 ITL (ms):                            2624.55   
P95 ITL (ms):                            5567.08   
P99 ITL (ms):                            7929.95   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          721156.13 
Median E2EL (ms):                        729146.58 
P50 E2EL (ms):                           729146.58 
P90 E2EL (ms):                           1013343.26
P95 E2EL (ms):                           1079875.55
P99 E2EL (ms):                           1197076.43
==================================================